# BuiltInFailures.FabricAreaFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricAreaFailures Class
BuiltInFailures Class Members See Also
---
Failures related to fabric area elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FabricAreaFailures
```

Visual Basic
---
```text
Public NotInheritable Class FabricAreaFailures
```

Visual C++
---
```text
public ref class FabricAreaFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..FabricAreaFailures
# See Also
BuiltInFailures..::..FabricAreaFailures Members
Autodesk.Revit.DB Namespace